{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "NICE", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "ragged": false, "name": "Input"}, "name": "Input", "inbound_nodes": []}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul", "op": "Mul", "input": ["Mul/x", "Input"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": [0.6258347630500793, 1.5633646249771118]}}, "name": "tf_op_layer_Mul", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "GatherV2", "trainable": true, "dtype": "float32", "node_def": {"name": "GatherV2", "op": "GatherV2", "input": ["Mul", "GatherV2/indices", "GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, "constants": {"1": [1, 0], "2": -1}}, "name": "tf_op_layer_GatherV2", "inbound_nodes": [[["tf_op_layer_Mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice", "op": "StridedSlice", "input": ["GatherV2", "strided_slice/begin", "strided_slice/end", "strided_slice/strides"], "attr": {"begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}}, "constants": {"1": [0, 0], "2": [0, 1], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice", "inbound_nodes": [[["tf_op_layer_GatherV2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_1", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_1", "op": "StridedSlice", "input": ["GatherV2", "strided_slice_1/begin", "strided_slice_1/end", "strided_slice_1/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 1], "2": [0, 0], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_1", "inbound_nodes": [[["tf_op_layer_GatherV2", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_6_input"}}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "sequential_2", "inbound_nodes": [[["tf_op_layer_strided_slice", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub", "op": "Sub", "input": ["strided_slice_1", "sequential_2/dense_8/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub", "inbound_nodes": [[["tf_op_layer_strided_slice_1", 0, 0, {}], ["sequential_2", 1, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat", "trainable": true, "dtype": "float32", "node_def": {"name": "concat", "op": "ConcatV2", "input": ["strided_slice", "Sub", "concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": -1}}, "name": "tf_op_layer_concat", "inbound_nodes": [[["tf_op_layer_strided_slice", 0, 0, {}], ["tf_op_layer_Sub", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "GatherV2_1", "trainable": true, "dtype": "float32", "node_def": {"name": "GatherV2_1", "op": "GatherV2", "input": ["concat", "GatherV2_1/indices", "GatherV2_1/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, "constants": {"1": [1, 0], "2": -1}}, "name": "tf_op_layer_GatherV2_1", "inbound_nodes": [[["tf_op_layer_concat", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_2", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_2", "op": "StridedSlice", "input": ["GatherV2_1", "strided_slice_2/begin", "strided_slice_2/end", "strided_slice_2/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 0], "2": [0, 1], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_2", "inbound_nodes": [[["tf_op_layer_GatherV2_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_3", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_3", "op": "StridedSlice", "input": ["GatherV2_1", "strided_slice_3/begin", "strided_slice_3/end", "strided_slice_3/strides"], "attr": {"begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, "constants": {"1": [0, 1], "2": [0, 0], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_3", "inbound_nodes": [[["tf_op_layer_GatherV2_1", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_3_input"}}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "sequential_1", "inbound_nodes": [[["tf_op_layer_strided_slice_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_1", "op": "Sub", "input": ["strided_slice_3", "sequential_1/dense_5/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_1", "inbound_nodes": [[["tf_op_layer_strided_slice_3", 0, 0, {}], ["sequential_1", 1, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_1", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_1", "op": "ConcatV2", "input": ["strided_slice_2", "Sub_1", "concat_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, "constants": {"2": -1}}, "name": "tf_op_layer_concat_1", "inbound_nodes": [[["tf_op_layer_strided_slice_2", 0, 0, {}], ["tf_op_layer_Sub_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "GatherV2_2", "trainable": true, "dtype": "float32", "node_def": {"name": "GatherV2_2", "op": "GatherV2", "input": ["concat_1", "GatherV2_2/indices", "GatherV2_2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}}}, "constants": {"1": [1, 0], "2": -1}}, "name": "tf_op_layer_GatherV2_2", "inbound_nodes": [[["tf_op_layer_concat_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_4", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_4", "op": "StridedSlice", "input": ["GatherV2_2", "strided_slice_4/begin", "strided_slice_4/end", "strided_slice_4/strides"], "attr": {"begin_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "0"}}}, "constants": {"1": [0, 0], "2": [0, 1], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_4", "inbound_nodes": [[["tf_op_layer_GatherV2_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_5", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_5", "op": "StridedSlice", "input": ["GatherV2_2", "strided_slice_5/begin", "strided_slice_5/end", "strided_slice_5/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "3"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 1], "2": [0, 0], "3": [1, 1]}}, "name": "tf_op_layer_strided_slice_5", "inbound_nodes": [[["tf_op_layer_GatherV2_2", 0, 0, {}]]]}, {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "dense_input"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "name": "sequential", "inbound_nodes": [[["tf_op_layer_strided_slice_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_2", "op": "Sub", "input": ["strided_slice_5", "sequential/dense_2/BiasAdd_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Sub_2", "inbound_nodes": [[["tf_op_layer_strided_slice_5", 0, 0, {}], ["sequential", 1, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "concat_2", "trainable": true, "dtype": "float32", "node_def": {"name": "concat_2", "op": "ConcatV2", "input": ["strided_slice_4", "Sub_2", "concat_2/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}}}, "constants": {"2": -1}}, "name": "tf_op_layer_concat_2", "inbound_nodes": [[["tf_op_layer_strided_slice_4", 0, 0, {}], ["tf_op_layer_Sub_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_1", "op": "Shape", "input": ["Input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_1", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_3", "op": "Sub", "input": ["concat_2", "Sub_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0.0, 0.0]}}, "name": "tf_op_layer_Sub_3", "inbound_nodes": [[["tf_op_layer_concat_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_7", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_7", "op": "StridedSlice", "input": ["Shape_1", "strided_slice_7/begin", "strided_slice_7/end", "strided_slice_7/strides"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, "constants": {"1": [1], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_7", "inbound_nodes": [[["tf_op_layer_Shape_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_2", "op": "Shape", "input": ["Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_2", "inbound_nodes": [[["tf_op_layer_Mul", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "ExpandDims", "trainable": true, "dtype": "float32", "node_def": {"name": "ExpandDims", "op": "ExpandDims", "input": ["Sub_3", "ExpandDims/dim"], "attr": {"T": {"type": "DT_FLOAT"}, "Tdim": {"type": "DT_INT32"}}}, "constants": {"1": -1}}, "name": "tf_op_layer_ExpandDims", "inbound_nodes": [[["tf_op_layer_Sub_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill", "op": "Fill", "input": ["strided_slice_7", "Fill/value"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill", "inbound_nodes": [[["tf_op_layer_strided_slice_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_8", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_8", "op": "StridedSlice", "input": ["Shape_2", "strided_slice_8/begin", "strided_slice_8/end", "strided_slice_8/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, "constants": {"1": [1], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_8", "inbound_nodes": [[["tf_op_layer_Shape_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_3", "op": "Shape", "input": ["GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_3", "inbound_nodes": [[["tf_op_layer_GatherV2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Squeeze", "trainable": true, "dtype": "float32", "node_def": {"name": "Squeeze", "op": "Squeeze", "input": ["ExpandDims"], "attr": {"squeeze_dims": {"list": {"i": ["-1"]}}, "T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Squeeze", "inbound_nodes": [[["tf_op_layer_ExpandDims", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_1", "op": "Mul", "input": ["Fill", "Mul_1/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": -0.02182859182357788}}, "name": "tf_op_layer_Mul_1", "inbound_nodes": [[["tf_op_layer_Fill", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_1", "op": "Fill", "input": ["strided_slice_8", "Fill_1/value"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill_1", "inbound_nodes": [[["tf_op_layer_strided_slice_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_9", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_9", "op": "StridedSlice", "input": ["Shape_3", "strided_slice_9/begin", "strided_slice_9/end", "strided_slice_9/strides"], "attr": {"end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, "constants": {"1": [1], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_9", "inbound_nodes": [[["tf_op_layer_Shape_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_4", "op": "Shape", "input": ["concat"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_4", "inbound_nodes": [[["tf_op_layer_concat", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_13", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_13", "op": "Shape", "input": ["Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_13", "inbound_nodes": [[["tf_op_layer_Squeeze", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_10", "op": "Shape", "input": ["Sub_3"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_10", "inbound_nodes": [[["tf_op_layer_Sub_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum", "op": "Sum", "input": ["Mul_1", "Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, "constants": {"1": []}}, "name": "tf_op_layer_Sum", "inbound_nodes": [[["tf_op_layer_Mul_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_2", "op": "Mul", "input": ["Fill_1", "Mul_2/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.0}}, "name": "tf_op_layer_Mul_2", "inbound_nodes": [[["tf_op_layer_Fill_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_2", "op": "Fill", "input": ["strided_slice_9", "Fill_2/value"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill_2", "inbound_nodes": [[["tf_op_layer_strided_slice_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_10", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_10", "op": "StridedSlice", "input": ["Shape_4", "strided_slice_10/begin", "strided_slice_10/end", "strided_slice_10/strides"], "attr": {"begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, "constants": {"1": [1], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_10", "inbound_nodes": [[["tf_op_layer_Shape_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_5", "op": "Shape", "input": ["GatherV2_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_5", "inbound_nodes": [[["tf_op_layer_GatherV2_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "PadV2", "trainable": true, "dtype": "float32", "node_def": {"name": "PadV2", "op": "PadV2", "input": ["Shape_13", "PadV2/paddings", "PadV2/constant_values"], "attr": {"Tpaddings": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, "constants": {"1": [[0, 0]], "2": 1}}, "name": "tf_op_layer_PadV2", "inbound_nodes": [[["tf_op_layer_Shape_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_16", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_16", "op": "StridedSlice", "input": ["Shape_10", "strided_slice_16/begin", "strided_slice_16/end", "strided_slice_16/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, "constants": {"1": [1], "2": [2], "3": [1]}}, "name": "tf_op_layer_strided_slice_16", "inbound_nodes": [[["tf_op_layer_Shape_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_11", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_11", "op": "Shape", "input": ["Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_11", "inbound_nodes": [[["tf_op_layer_Squeeze", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2", "op": "AddV2", "input": ["AddV2/x", "Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_AddV2", "inbound_nodes": [[["tf_op_layer_Sum", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_1", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_1", "op": "Sum", "input": ["Mul_2", "Sum_1/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_Sum_1", "inbound_nodes": [[["tf_op_layer_Mul_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_3", "op": "Mul", "input": ["Fill_2", "Mul_3/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [[1.0]]}}, "name": "tf_op_layer_Mul_3", "inbound_nodes": [[["tf_op_layer_Fill_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_3", "op": "Fill", "input": ["strided_slice_10", "Fill_3/value"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill_3", "inbound_nodes": [[["tf_op_layer_strided_slice_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_11", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_11", "op": "StridedSlice", "input": ["Shape_5", "strided_slice_11/begin", "strided_slice_11/end", "strided_slice_11/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, "constants": {"1": [1], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_11", "inbound_nodes": [[["tf_op_layer_Shape_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_6", "op": "Shape", "input": ["concat_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_6", "inbound_nodes": [[["tf_op_layer_concat_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Reshape", "trainable": true, "dtype": "float32", "node_def": {"name": "Reshape", "op": "Reshape", "input": ["Squeeze", "PadV2"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Reshape", "inbound_nodes": [[["tf_op_layer_Squeeze", 0, 0, {}], ["tf_op_layer_PadV2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_8", "op": "Fill", "input": ["strided_slice_16", "Fill_8/value"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill_8", "inbound_nodes": [[["tf_op_layer_strided_slice_16", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_17", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_17", "op": "StridedSlice", "input": ["Shape_11", "strided_slice_17/begin", "strided_slice_17/end", "strided_slice_17/strides"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, "constants": {"1": [1], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_17", "inbound_nodes": [[["tf_op_layer_Shape_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_1", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_1", "op": "AddV2", "input": ["AddV2", "Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_1", "inbound_nodes": [[["tf_op_layer_AddV2", 0, 0, {}], ["tf_op_layer_Sum_1", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_2", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_2", "op": "Sum", "input": ["Mul_3", "Sum_2/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_Sum_2", "inbound_nodes": [[["tf_op_layer_Mul_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_4", "op": "Mul", "input": ["Fill_3", "Mul_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.0}}, "name": "tf_op_layer_Mul_4", "inbound_nodes": [[["tf_op_layer_Fill_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_4", "op": "Fill", "input": ["strided_slice_11", "Fill_4/value"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill_4", "inbound_nodes": [[["tf_op_layer_strided_slice_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_12", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_12", "op": "StridedSlice", "input": ["Shape_6", "strided_slice_12/begin", "strided_slice_12/end", "strided_slice_12/strides"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, "constants": {"1": [1], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_12", "inbound_nodes": [[["tf_op_layer_Shape_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_7", "op": "Shape", "input": ["GatherV2_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_7", "inbound_nodes": [[["tf_op_layer_GatherV2_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Transpose", "trainable": true, "dtype": "float32", "node_def": {"name": "Transpose", "op": "Transpose", "input": ["Reshape", "Transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [0, 1]}}, "name": "tf_op_layer_Transpose", "inbound_nodes": [[["tf_op_layer_Reshape", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_9", "op": "Mul", "input": ["Fill_8", "Mul_9/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": -0.0}}, "name": "tf_op_layer_Mul_9", "inbound_nodes": [[["tf_op_layer_Fill_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_9", "op": "Fill", "input": ["strided_slice_17", "Fill_9/value"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill_9", "inbound_nodes": [[["tf_op_layer_strided_slice_17", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_2", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_2", "op": "AddV2", "input": ["AddV2_1", "Sum_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_2", "inbound_nodes": [[["tf_op_layer_AddV2_1", 0, 0, {}], ["tf_op_layer_Sum_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_3", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_3", "op": "Sum", "input": ["Mul_4", "Sum_3/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_Sum_3", "inbound_nodes": [[["tf_op_layer_Mul_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_5", "op": "Mul", "input": ["Fill_4", "Mul_5/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [[1.0]]}}, "name": "tf_op_layer_Mul_5", "inbound_nodes": [[["tf_op_layer_Fill_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_5", "op": "Fill", "input": ["strided_slice_12", "Fill_5/value"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill_5", "inbound_nodes": [[["tf_op_layer_strided_slice_12", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_13", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_13", "op": "StridedSlice", "input": ["Shape_7", "strided_slice_13/begin", "strided_slice_13/end", "strided_slice_13/strides"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "0"}}}, "constants": {"1": [1], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_13", "inbound_nodes": [[["tf_op_layer_Shape_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "RealDiv", "trainable": true, "dtype": "float32", "node_def": {"name": "RealDiv", "op": "RealDiv", "input": ["Transpose", "RealDiv/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_RealDiv", "inbound_nodes": [[["tf_op_layer_Transpose", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_12", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_12", "op": "Shape", "input": ["concat_2"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_12", "inbound_nodes": [[["tf_op_layer_concat_2", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_8", "op": "Sum", "input": ["Mul_9", "Sum_8/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": [-1]}}, "name": "tf_op_layer_Sum_8", "inbound_nodes": [[["tf_op_layer_Mul_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_10", "op": "Mul", "input": ["Fill_9", "Mul_10/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": -0.0}}, "name": "tf_op_layer_Mul_10", "inbound_nodes": [[["tf_op_layer_Fill_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_3", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_3", "op": "AddV2", "input": ["AddV2_2", "Sum_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_3", "inbound_nodes": [[["tf_op_layer_AddV2_2", 0, 0, {}], ["tf_op_layer_Sum_3", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_4", "op": "Sum", "input": ["Mul_5", "Sum_4/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_Sum_4", "inbound_nodes": [[["tf_op_layer_Mul_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_6", "op": "Mul", "input": ["Fill_5", "Mul_6/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.0}}, "name": "tf_op_layer_Mul_6", "inbound_nodes": [[["tf_op_layer_Fill_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_6", "op": "Fill", "input": ["strided_slice_13", "Fill_6/value"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill_6", "inbound_nodes": [[["tf_op_layer_strided_slice_13", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "SquaredDifference", "trainable": true, "dtype": "float32", "node_def": {"name": "SquaredDifference", "op": "SquaredDifference", "input": ["RealDiv", "SquaredDifference/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.0}}, "name": "tf_op_layer_SquaredDifference", "inbound_nodes": [[["tf_op_layer_RealDiv", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_18", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_18", "op": "StridedSlice", "input": ["Shape_12", "strided_slice_18/begin", "strided_slice_18/end", "strided_slice_18/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}}}, "constants": {"1": [1], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_18", "inbound_nodes": [[["tf_op_layer_Shape_12", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_7", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_7", "op": "AddV2", "input": ["AddV2_7/x", "Sum_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": 0.0}}, "name": "tf_op_layer_AddV2_7", "inbound_nodes": [[["tf_op_layer_Sum_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_9", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_9", "op": "Sum", "input": ["Mul_10", "Sum_9/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_Sum_9", "inbound_nodes": [[["tf_op_layer_Mul_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Shape_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Shape_8", "op": "Shape", "input": ["Input"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, "constants": {}}, "name": "tf_op_layer_Shape_8", "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_4", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_4", "op": "AddV2", "input": ["AddV2_3", "Sum_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_4", "inbound_nodes": [[["tf_op_layer_AddV2_3", 0, 0, {}], ["tf_op_layer_Sum_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_5", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_5", "op": "Sum", "input": ["Mul_6", "Sum_5/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_Sum_5", "inbound_nodes": [[["tf_op_layer_Mul_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_7", "op": "Mul", "input": ["Fill_6", "Mul_7/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": [[1.0]]}}, "name": "tf_op_layer_Mul_7", "inbound_nodes": [[["tf_op_layer_Fill_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_12", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_12", "op": "Mul", "input": ["Mul_12/x", "SquaredDifference"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"0": -0.5}}, "name": "tf_op_layer_Mul_12", "inbound_nodes": [[["tf_op_layer_SquaredDifference", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_10", "op": "Fill", "input": ["strided_slice_18", "Fill_10/value"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill_10", "inbound_nodes": [[["tf_op_layer_strided_slice_18", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_8", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_8", "op": "AddV2", "input": ["AddV2_7", "Sum_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_8", "inbound_nodes": [[["tf_op_layer_AddV2_7", 0, 0, {}], ["tf_op_layer_Sum_9", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "strided_slice_14", "trainable": true, "dtype": "float32", "node_def": {"name": "strided_slice_14", "op": "StridedSlice", "input": ["Shape_8", "strided_slice_14/begin", "strided_slice_14/end", "strided_slice_14/strides"], "attr": {"shrink_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}}}, "constants": {"1": [1], "2": [1], "3": [1]}}, "name": "tf_op_layer_strided_slice_14", "inbound_nodes": [[["tf_op_layer_Shape_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_5", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_5", "op": "AddV2", "input": ["AddV2_4", "Sum_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_5", "inbound_nodes": [[["tf_op_layer_AddV2_4", 0, 0, {}], ["tf_op_layer_Sum_5", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_6", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_6", "op": "Sum", "input": ["Mul_7", "Sum_6/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_Sum_6", "inbound_nodes": [[["tf_op_layer_Mul_7", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sub_4", "trainable": true, "dtype": "float32", "node_def": {"name": "Sub_4", "op": "Sub", "input": ["Mul_12", "Sub_4/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {"1": 0.9189385175704956}}, "name": "tf_op_layer_Sub_4", "inbound_nodes": [[["tf_op_layer_Mul_12", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_11", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_11", "op": "Mul", "input": ["Fill_10", "AddV2_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_11", "inbound_nodes": [[["tf_op_layer_Fill_10", 0, 0, {}], ["tf_op_layer_AddV2_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Fill_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Fill_7", "op": "Fill", "input": ["strided_slice_14", "Fill_7/value"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": 1.0}}, "name": "tf_op_layer_Fill_7", "inbound_nodes": [[["tf_op_layer_strided_slice_14", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_6", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_6", "op": "AddV2", "input": ["AddV2_5", "Sum_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_6", "inbound_nodes": [[["tf_op_layer_AddV2_5", 0, 0, {}], ["tf_op_layer_Sum_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_11", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_11", "op": "Sum", "input": ["Sub_4", "Sum_11/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, "constants": {"1": [1]}}, "name": "tf_op_layer_Sum_11", "inbound_nodes": [[["tf_op_layer_Sub_4", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_10", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_10", "op": "Sum", "input": ["Mul_11", "Sum_10/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_Sum_10", "inbound_nodes": [[["tf_op_layer_Mul_11", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Mul_8", "trainable": true, "dtype": "float32", "node_def": {"name": "Mul_8", "op": "Mul", "input": ["Fill_7", "AddV2_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_Mul_8", "inbound_nodes": [[["tf_op_layer_Fill_7", 0, 0, {}], ["tf_op_layer_AddV2_6", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_9", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_9", "op": "AddV2", "input": ["Sum_11", "Sum_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_9", "inbound_nodes": [[["tf_op_layer_Sum_11", 0, 0, {}], ["tf_op_layer_Sum_10", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "Sum_7", "trainable": true, "dtype": "float32", "node_def": {"name": "Sum_7", "op": "Sum", "input": ["Mul_8", "Sum_7/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, "constants": {"1": []}}, "name": "tf_op_layer_Sum_7", "inbound_nodes": [[["tf_op_layer_Mul_8", 0, 0, {}]]]}, {"class_name": "TensorFlowOpLayer", "config": {"name": "AddV2_10", "trainable": true, "dtype": "float32", "node_def": {"name": "AddV2_10", "op": "AddV2", "input": ["AddV2_9", "Sum_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, "constants": {}}, "name": "tf_op_layer_AddV2_10", "inbound_nodes": [[["tf_op_layer_AddV2_9", 0, 0, {}], ["tf_op_layer_Sum_7", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0]], "output_layers": [["tf_op_layer_AddV2_10", 0, 0]]}}, "training_config": {"loss": "<lambda>", "metrics": null, "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "dense/kernel", "shape": [1, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [1, 512], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [1, 512], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_8/kernel", "shape": [512, 1], "dtype": "float32"}, {"name": "dense_8/bias", "shape": [1], "dtype": "float32"}]}]}